{
  "root": "Top-level sections mirror the README: defaults, pipelines, modules, database, webui, alerts, and baseline. Each block is independent, so keep indentation consistent and prefer spaces over tabs.",
  "defaults": "defaults: global knobs applied to every module unless overridden. Good place for llm_min_severity and max_chunk_lines.",
  "defaults_llm_enabled": "defaults.llm_enabled: gate LLM payload generation everywhere by default. Flip to false to disable payloads globally.",
  "defaults_llm_min_severity": "defaults.llm_min_severity: minimum severity to emit LLM payloads; WARNING in the README example. Use DEBUG/INFO/WARNING/ERROR/CRITICAL.",
  "defaults_max_chunk_lines": "defaults.max_chunk_lines: cap chunk size before grouping/LLM to avoid giant payloads; typical values range from 120-500.",
  "pipelines": "pipelines: reusable grouping + classifier bundles referenced by modules via pipeline_name. Keep names short and lowercase.",
  "pipelines_match": "pipelines.match.filename_regex: regex to pick which files feed this pipeline. Use anchors to avoid accidental matches.",
  "pipelines_grouping": "pipelines.grouping: choose whole_file or marker to define chunk boundaries. For marker, set start/end strings per the README grouping section.",
  "pipelines_classifier": "pipelines.classifier: regex_counter or rsnapshot_basic; set error/warning/ignore regex lists. Make regexes specific to avoid noise.",
  "pipelines_llm": "pipelines.llm: enable per-pipeline payloads, set min_severity, max_chunk_lines, and optional prompt_template paths. Set enabled: true to turn it on.",
  "pipelines_ignore": "pipelines.classifier.ignore_regexes: drop known noisy lines before counting severities.",
  "modules": "modules: concrete tasks; each ties a path + mode to a pipeline and output options.",
  "modules_path": "modules.path: source log file or directory (batch) pulled by logtriage. Ensure the service can read it.",
  "modules_mode": "modules.mode: batch scans once, follow tails a file, stream tails with interval, journal reads systemd logs. Match the README examples.",
  "modules_pipeline": "modules.pipeline: name of a pipeline entry; controls grouping/classifier used on this module.",
  "modules_output_format": "modules.output_format: json or text summaries written by the CLI.",
  "modules_llm_payload_mode": "modules.llm_payload_mode: errors_only or full—matches README guidance on LLM payload size.",
  "modules_only_last_chunk": "modules.only_last_chunk: true to only analyze most recent chunk per file (e.g., last rsnapshot run).",
  "modules_exit_code_by_severity": "modules.exit_code_by_severity: map severity to process exit codes for automation.",
  "modules_alerts": "modules.alerts: optional webhook/mqtt sinks; match README examples for headers, topics, and min_severity.",
  "modules_baseline": "modules.baseline: anomaly detection window and multipliers controlling severity adjustments.",
  "modules_stream": "modules.stream: stream/tailing settings like from_beginning and interval.",
  "database": "database: URL + retention_days. Web UI and CLI must share this to show per-module stats.",
  "database_retention_days": "database.retention_days: how long to keep historical chunks before cleanup.",
  "webui": "webui: host/port/base_path plus security (secret_key, allowed_ips) and admin_users with bcrypt hashes.",
  "webui_admin_users": "webui.admin_users: usernames + password_hash fields. Update via Password page or regenerate hashes.",
  "webui_allowed_ips": "webui.allowed_ips: IP allowlist for the UI; empty list means allow all. Add addresses as strings.",
  "webui_secret_key": "webui.secret_key: long random string used for session signing; rotate to sign everyone out.",
  "webui_session_cookie_name": "webui.session_cookie_name: customize cookie name to avoid clashes behind reverse proxies.",
  "alerts": "alerts: webhook + MQTT hooks; follow README examples for headers, topics, and min_severity.",
  "baseline": "baseline: enable baseline detection, window size, and multipliers controlling anomaly severity bump."
}
